							LAB#3

task#    create two vlan virtually in one vlan
		Vlan2 	sales
		vlan3	accounts

Straight Through wire: For connecting the different devices
Cross over wire: For connecting the same device.

N	N	N H
192.168.1.0  Net id
192.168.1.1  gateway Id
192.168.1.2	host id
.
.
.
.
.
192.168.1.254 	last host
192.168.1.0  	Broadcast IP



In switch CLI

//For intering into preveliged  mode of the mode
switch>enable
switch# show  vlan      //this called preveliged mode    //only work in preveliged mode

//For intering into configration mode of the mode
switch# config terminal 
switch(config)# hostname salesAccounts
salesAccounts(config)# 

//For entering into vlan or adding another vlan
salesAccounts(config)# vlan 2
salesAccounts(config)# name jamal

//For existing like going one step back
salesAccounts(config)# exit

//For checking that the vlan is created or not
salesAccounts(config)# do show vlan      		//can't use show vlan/sh vlan


FOR Adding the new Vlan stay in configratipn mode
salesAccounts(config)# name vlan2


For assigning PC's to switch ports

salesAccounts(config)#interfac fa0/1
salesAccounts(config)#switchport mode access		//only communicate within the its vlan
salesAccounts(config)#switchport access vlan 2		//for assigning port to vlan

By using Range
alesAccounts(config)#in range fa0/1 - 6		//give range
salesAccounts(config)#switchport mode access		//only communicate within the its vlan
alesAccounts(config)#switchport access vlan 3		//only communicate within the its vlan




HOW TO REMOVE THE VLAN


//Remove Specific Vlan
Command : 
 (config)#no vlan 2			// 2 means second no vlan remove 
(config)#sh flash				//show database of the vlan

//Remove All Vlan in prevelidged mode
Command:
delete  ?			//give option
delete vlan.dat		// get confirmation and then say yes and delete


// For making Trunk   
//why trunk   =>    for carring  the multiple switch lan's 
			  =>	    instead using two switch using one switch by making two lan's in one switch of 						different network to connect

switch(config)#interfac fa0/24
switch(config)#switchport mode trunk		//only communicate within the its vlan


//Router Work

//For intering into preveliged  mode of the mode
router>enable
router# show  vlan      //this called preveliged mode    //only work in preveliged mode

//For intering into configration mode of the mode
router# config terminal 



router(config-if)#int fa0/0		//entering into the fa0/1 mode
router(config-if)#no shut		//entering into the fa0/1 mode	

router(config-sub-if)#int fa0/0.1				//entering into sub fa0/0.1 mode
router(config-sub-if)#encapsulation ?			//entering into the fa0/1 mode
router(config-sub-if)#encapsulation dot 1Q 2	//label that tells which lan is communicating
router(config-sub-if)#ip add 192.168.1.1    255.255.255.0			//give gateway id and subnet marks


//For showing Ip's
router#sh ip int br






